# Numpy

In [1]:
a = [1,2,3]
b = [2,3,4]

In [4]:
for z, i in zip(a,b):
    print(z*i)
[z*i for z,i in zip(a,b)]

2
6
12

[2, 6, 12]

In [5]:
import numpy as np
a = np.array([1,2,3])
b = np.array([2,3,4])

In [6]:
type(a)

numpy.ndarray

In [7]:
a*b

array([ 2,  6, 12])

In [8]:
import numpy as np
na = np.array([['name', 'gender', 'age'], ['frank', 'M', 29], ['mary', 'F', 23], ['tom', 'M', 35], ['ted', 'M', 33], ['jean', 'F', 21], ['lisa', 'F', 20]])
na

array([['name', 'gender', 'age'],
       ['frank', 'M', '29'],
       ['mary', 'F', '23'],
       ['tom', 'M', '35'],
       ['ted', 'M', '33'],
       ['jean', 'F', '21'],
       ['lisa', 'F', '20']], dtype='<U6')

In [13]:
import pandas as pd
df = pd.DataFrame([['frank', 'M', 29], ['mary', 'F', 23], ['tom', 'M', 35], ['ted', 'M', 33], ['jean', 'F', 21], ['lisa', 'F', 20]])
df

       0  1   2
0  frank  M  29
1   mary  F  23
2    tom  M  35
3    ted  M  33
4   jean  F  21
5   lisa  F  20

In [14]:
df.columns = ['name','gender','age']

In [15]:
df

    name gender  age
0  frank      M   29
1   mary      F   23
2    tom      M   35
3    ted      M   33
4   jean      F   21
5   lisa      F   20

# Series

In [17]:
import pandas as pd
phone = pd.Series([21000,19000,18000])
phone

0    21000
1    19000
2    18000
dtype: int64

In [19]:
phone = pd.Series([21000,19000,18000],index = ['Iphone 7','MI','VIVO'])
phone

Iphone 7    21000
MI          19000
VIVO        18000
dtype: int64

In [20]:
phone[1]

19000

In [21]:
phone['VIVO']

18000

# DataFrame

In [23]:
import pandas as pd
df = pd.DataFrame([['frank', 'M', 29], ['mary', 'F', 23], ['tom', 'M', 35], ['ted', 'M', 33], ['jean', 'F', 21], ['lisa', 'F', 20]])
df.columns = ['name','gender','age']
df

    name gender  age
0  frank      M   29
1   mary      F   23
2    tom      M   35
3    ted      M   33
4   jean      F   21
5   lisa      F   20

In [25]:
df.head(2)

    name gender  age
0  frank      M   29
1   mary      F   23

In [26]:
df.tail(3)

   name gender  age
3   ted      M   33
4  jean      F   21
5  lisa      F   20

In [27]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6 entries, 0 to 5
Data columns (total 3 columns):
name      6 non-null object
gender    6 non-null object
age       6 non-null int64
dtypes: int64(1), object(2)
memory usage: 272.0+ bytes

In [28]:
df.describe()

             age
count   6.000000
mean   26.833333
std     6.400521
min    20.000000
25%    21.500000
50%    26.000000
75%    32.000000
max    35.000000